package com.the703.basic010;
// 1. 클래스는 부품객체
// 2. 클래스는 상태(멤버변수)와 행위(멤버함수)를 갖는다
class FishBB{
	// 멤버 변수 - bread, bean
	// 멤버 함수 - show
	String bread;
	int bean;
	void show() {System.out.println(bread + "가루에 팥 " + bean + "스푼으로 만들 붕어빵");}
}

public class Class002 {
	public static void main(String[] args) {
		FishBB my1 = new FishBB();
		// 1. new (1번지, 객체 생성) 2. FishBB() 초기화 3. my1 주소 = 1번지
		my1.bread = "도토리";
		my1.bean = 2;
		my1.show();
	}
}

////////////////////////////////////////////////////////////////////////////////
/* [RUNTIME DATA AREA]
-------------------------------------------------------------------------------
[METHOD:정보]		FishBB.class(설계도) , Class002.class #1
-------------------------------------------------------------------------------
[HEAP:동적]      				   					  	 	|  [STACK:지역]
16번째,17번째 줄 				"도토리"      2
14번째 줄 1 번지 : FishBB{bread=null, bean=0, show()}		 <-	my1(1번지) 
															main #2
-------------------------------------------------------------------------------
*/
///////////////////////////////////////////////////////////////////////////////